#include <stdio.h>

extern int choice_main, choice_logon_regist, choice_admin, choice_user;
extern char name[20], phone[12], passwd[20];


/* 
	该源文件用于显示控制台菜单 
	包括以下菜单或显示信息 
	
	开始画面、主菜单、登录OR注册选择菜单
	 
	登录菜单、注册菜单、管理员功能菜单、普通用户功能菜单
	
	 错误选择报错、密码错误报错、注册用户名重复报错 
*/ 


void menu_begin()
{
	printf(" ----------------------------------------------------- \n");
    printf("|                                                     |\n");
    printf("|                                                     |\n");
    printf("|              欢迎使用模拟投票小程序                 |\n");
    printf("|                                                     |\n");
    printf("|                                                     |\n");
    printf("|                 用户数据加载中...                   |\n");
    printf("|                     请稍后                          |\n");
    printf("|                                                     |\n");
    printf("|                                                     |\n");
    printf(" ----------------------------------------------------- \n");
}

void menu_main()
{
	printf(" ----------------------------------------------------- \n");
    printf("|                请选择用户类型：                     |\n");
    printf("|                                                     |\n");
    printf("|                 1、管理员                           |\n");
    printf("|                                                     |\n");
    printf("|                 2、参选者                           |\n");
    printf("|                                                     |\n");
    printf("|                 3、注册用户                         |\n");
    printf("|                                                     |\n");
    printf("|                 4、退出程序                         |\n");
    printf(" ----------------------------------------------------- \n\n");
    printf("                 请输入你的选择：");
    scanf("%d", &choice_main);
}

void menu_logon_regist()
{
	printf(" ----------------------------------------------------- \n");
    printf("|                 1、登录                             |\n");
    printf("|                                                     |\n");
    printf("|                 2、注册                             |\n");
    printf(" ----------------------------------------------------- \n\n");
    printf("                 请输入你的选择：");
    scanf("%d", &choice_logon_regist);
}

void menu_logon()
{
	printf(" ----------------------------------------------------- \n");
    printf("                 请输入用户名：");
    scanf("%s", name);
    printf("                                                       \n");
    printf("                 请输入密码：");
    scanf("%s", passwd);
    printf(" ----------------------------------------------------- \n");
}

void menu_regist()
{
	printf(" ----------------------------------------------------- \n");
    printf("         请输入用户名（要求六个字符或三个汉字）：");
    scanf("%s", name);
    printf("                                                       \n");
    printf("             请输入注册手机号（要求11位）：");
    scanf("%s", phone);
    printf("                                                       \n");
    printf("                 请输入密码：");
    scanf("%s", passwd);
    printf(" ----------------------------------------------------- \n");
}

void menu_admin()
{
	printf(" ----------------------------------------------------- \n");
    printf("|                管理员权限可操作：                   |\n");
    printf("|                                                     |\n");
    printf("|                 1、查询信息                         |\n");
    printf("|                                                     |\n");
    printf("|                 2、设置投票数量上限                 |\n");
    printf("|                                                     |\n");
    printf("|                 3、发布投票最终结果                 |\n");
    printf(" ----------------------------------------------------- \n\n");
    printf("                 请输入你的选择：");
    scanf("%d", &choice_admin);
}

void menu_user()
{
	printf(" ----------------------------------------------------- \n");
    printf("|                请选择要进行的操作：                 |\n");
    printf("|                                                     |\n");
    printf("|                 1、查询参选者信息                   |\n");
    printf("|                                                     |\n");
    printf("|                 2、搜索参选者                       |\n");
    printf("|                                                     |\n");
    printf("|                 3、投票                             |\n");
    printf(" ----------------------------------------------------- \n\n");
    printf("                 请输入你的选择：");
    scanf("%d", &choice_user);
}

void menu_end()
{
	printf(" ----------------------------------------------------- \n");
    printf("|                                                     |\n");
    printf("|                                                     |\n");
    printf("|                感谢您的使用与支持！                 |\n");
    printf("|                                                     |\n");
    printf("|                                                     |\n");
    printf("|                   欢迎再次使用                      |\n");
    printf("|                                                     |\n");
    printf("|                                                     |\n");
    printf("|                                                     |\n");
    printf(" ----------------------------------------------------- \n");
} 

void error_input()
{
	printf(" ----------------------------------------------------- \n");
    printf("|                                                     |\n");
    printf("|                     错误输入！                      |\n");
    printf("|                                                     |\n");
    printf(" ----------------------------------------------------- \n");
}

void error_logon()
{
	printf(" ----------------------------------------------------- \n");
    printf("|                                                     |\n");
    printf("|               用户不存在或密码错误！                |\n");
    printf("|                                                     |\n");
    printf(" ----------------------------------------------------- \n");
}

void error_regist()
{
	printf(" ----------------------------------------------------- \n");
    printf("|                                                     |\n");
    printf("|               用户名已被占用请重试！                |\n");
    printf("|                                                     |\n");
    printf(" ----------------------------------------------------- \n");
}
